package com.ui.seoul.seoulopenapi.biz.v1.model.type;

public enum ForeCastAreaType {

    서울("11B10101"),
    인천("11B20201"),
    수원("11B20601"),
    성남("11B20605"),
    안양("11B20602"),
    광명("11B10103"),
    과천("11B10102"),
    평택("11B20606"),
    오산("11B20603"),
    의왕("11B20609"),
    용인("11B20612"),
    군포("11B20610"),
    안성("11B20611"),
    화성("11B20604"),
    양평("11B20503"),
    구리("11B20501"),
    남양주("11B20502"),
    하남("11B20504"),
    이천("11B20701"),
    여주("11B20703"),
    광주("11B20702"),
    의정부("11B20301"),
    고양("11B20302"),
    파주("11B20305"),
    양주("11B20304"),
    동두천("11B20401"),
    연천("11B20402"),
    포천("11B20403"),
    가평("11B20404"),
    강화("11B20101"),
    김포("11B20102"),
    시흥("11B20202"),
    부천("11B20204"),
    안산("11B20203"),
    백령도("11A00101");
    private String getCode;

   ForeCastAreaType(String getCode) {
        this.getCode = getCode;
    }

    public String getCode() {
        return this.getCode;
    }


}
